{"title":"Valtech Frontend Tech Radar","blips":[{"name":"LESS","description":"Less (which stands for Leaner Style Sheets) is a backwards-compatible language extension for CSS. This is the official documentation for Less, the language and Less.js, the JavaScript tool that converts your Less styles to CSS styles.\n\nBecause Less looks just like CSS, learning it is a breeze. Less only makes a few convenient additions to the CSS language, which is one of the reasons it can be learned so quickly.","url":"https://lesscss.org/","status":"On hold","category":"Languages and frameworks","isNew":false,"history":[{"ring":"Adopt","description":"Moved in favor of Sass and PostCSS","_metadata":{"uid":"cse2a66b6e9a78d670"}}],"comments":""},{"name":"Figma","description":"Figma is a web-based graphics editing and user interface design app. You can use it to do all kinds of graphic design work from wireframing websites, designing mobile app interfaces, prototyping designs, crafting social media posts, and everything in between.\n\nFigma is different from other graphics editing tools. Mainly because it works directly on your browser. This means you get to access your projects and start designing from any computer or platform without having to buy multiple licenses or install software.","url":"https://www.figma.com/","status":"Trial","category":"Unsorted","isNew":true,"history":[],"comments":""},{"name":"next gen bundlers (snowpack, vite)","description":"","url":"https://css-tricks.com/comparing-the-new-generation-of-build-tools/","status":"Assess","category":"Unsorted","isNew":false,"history":[],"comments":""},{"name":"Continuous integration (CI)","description":"Continuous integration (CI) is the practice of automating the integration of code changes from multiple contributors into a single software project. It’s a primary DevOps best practice, allowing developers to frequently merge code changes into a central repository where builds and tests then run. Automated tools are used to assert the new code’s correctness before integration.\n\nA source code version control system is the crux of the CI process. The version control system is also supplemented with other checks like automated code quality tests, syntax style review tools, and more.  ","url":"https://www.atlassian.com/continuous-delivery/continuous-integration","status":"Adopt","category":"Unsorted","isNew":false,"history":[],"comments":""},{"name":"AngularJs","description":"AngularJS is a toolset for building the framework most suited to your application development. It is fully extensible and works well with other libraries. ","url":"https://angularjs.org/","status":"On hold","category":"Languages and frameworks","isNew":false,"history":[],"comments":"AngularJS support has officially ended as of January 2022."},{"name":"Zurb Foundation","description":"A Framework for any device, medium, and accessibility. Foundation is a family of responsive front-end frameworks that make it easy to design beautiful responsive websites, apps and emails that look amazing on any device. Foundation is semantic, readable, flexible, and completely customizable. We’re constantly adding new resources and code snippets, including these handy HTML templates to help get you started!","url":"https://get.foundation/","status":"On hold","category":"Languages and frameworks","isNew":false,"history":[],"comments":""},{"name":"Web components","description":"Web Components is a suite of different technologies allowing you to create reusable custom elements — with their functionality encapsulated away from the rest of your code — and utilize them in your web apps.","url":"https://developer.mozilla.org/en-US/docs/Web/Web_Components","status":"Trial","category":"Languages and frameworks","isNew":false,"history":[],"comments":""},{"name":"Vue.js","description":"Vue is a JavaScript framework for building user interfaces. It builds on top of standard HTML, CSS and JavaScript, and provides a declarative and component-based programming model that helps you efficiently develop user interfaces, be it simple or complex.","url":"https://vuejs.org/","status":"Adopt","category":"Languages and frameworks","isNew":false,"history":[],"comments":""},{"name":"TypeScript","description":"TypeScript is JavaScript with syntax for types. TypeScript is a strongly typed programming language that builds on JavaScript, giving you better tooling at any scale. TypeScript adds additional syntax to JavaScript to support a tighter integration with your editor. Catch errors early in your editor.","url":"https://www.typescriptlang.org/","status":"Adopt","category":"Languages and frameworks","isNew":false,"history":[],"comments":""},{"name":"Bootstrap","description":"Build fast, responsive sites with Bootstrap. Quickly design and customize responsive mobile-first sites with Bootstrap, the world’s most popular front-end open source toolkit, featuring Sass variables and mixins, responsive grid system, extensive prebuilt components, and powerful JavaScript plugins.","url":"https://getbootstrap.com/","status":"On hold","category":"Languages and frameworks","isNew":false,"history":[],"comments":""},{"name":"Testing Library","description":"The Testing Library family of libraries is a very light-weight solution for testing without all the implementation details. The main utilities it provides involve querying for nodes similarly to how users would find them. In this way, testing-library helps ensure your tests give you confidence in your UI code.\n\nIt can be used with a major js frameworks.","url":"https://testing-library.com/","status":"Trial","category":"Unsorted","isNew":false,"history":[],"comments":""},{"name":"Conventional Commits","description":"The Conventional Commits specification is a lightweight convention on top of commit messages. It provides an easy set of rules for creating an explicit commit history; which makes it easier to write automated tools on top of. This convention dovetails with SemVer, by describing the features, fixes, and breaking changes made in commit messages.","url":"https://www.conventionalcommits.org/","status":"Trial","category":"Unsorted","isNew":false,"history":[],"comments":""},{"name":"Susy","description":"Susy is a design-agnostic set of tools for creating powerful, custom layouts. We didn't want another grid system full of rules and restrictions — we wanted a power tool for building our own damn systems. Version Three is trimmed down to it's most basic components — functions that can be used to build any grid system.","url":"https://github.com/oddbird/susy","status":"On hold","category":"Languages and frameworks","isNew":false,"history":[],"comments":"Susy is Deprecated. It should no longer be used on new projects, and will no longer be receiving any updates."},{"name":"Tailwind CSS","description":"Tailwind CSS can be used to make websites in the fastest and the easiest way. Tailwind CSS is basically a utility-first CSS framework for rapidly building custom user interfaces. It is a highly customizable, low-level CSS framework that gives you all of the building blocks you need to build bespoke designs without any annoying opinionated styles you have to fight to override. ","url":"https://tailwindcss.com/","status":"On hold","category":"Languages and frameworks","isNew":false,"history":[],"comments":""},{"name":"SASS","description":"Sass (Syntactically Awesome Style Sheets) is an extension of CSS. Style sheet languages control where and how text appears on a webpage, from frame size and color to menu positions.\n\nCSS is used all over the web, but that doesn't make it the smoothest coding experience. It was designed to help developers write instructions on how to present text on a screen rather than to work with variables or perform complex decision-making tasks.\n\nAs you'll find out, Sass addresses some of these serious shortcomings of CSS, saving developers time and effort on projects.","url":"https://sass-lang.com/","status":"Adopt","category":"Languages and frameworks","isNew":false,"history":[],"comments":"Use sass for missing postcss features"},{"name":"React","description":"React is a declarative, efficient, and flexible JavaScript library for building user interfaces. It lets you compose complex UIs from small and isolated pieces of code called “components”.","url":"https://reactjs.org/","status":"Adopt","category":"Languages and frameworks","isNew":false,"history":[],"comments":""},{"name":"Pug","description":"pug.js, also known as PUG, is a Javascript library that was previously known as JADE. It is an easy-to-code template engine used to code HTML in a more readable fashion. One upside to PUG is that it equips developers to code reusable HTML documents by pulling data dynamically from the API.","url":"https://pugjs.org/","status":"On hold","category":"Languages and frameworks","isNew":false,"history":[],"comments":""},{"name":"Moment.js","description":"Moment.js is a stand-alone open-source JavaScript framework wrapper for date objects that eliminates native JavaScript date objects, which are cumbersome to use. Moment.js makes dates and time easy to display, format, parse, validate, and manipulate using a clean and concise API. It comes with many plugins with useful features such as a short date formatter, fiscal quarters, timers, twitter dates, ISO calendars, Google Calendar API, date ranges, time zones support, date calculations, multi-languages support, localized time, date manipulation functionalities, and many other special date utilities.","url":"https://momentjs.com/","status":"On hold","category":"Languages and frameworks","isNew":false,"history":[],"comments":""},{"name":"Lodash","description":"Lodash is a JavaScript library that provides utility functions for common programming tasks using a functional programming paradigm; it builds upon the older underscore.js library.\n\nLodash has several built-in utility functions that make coding in JavaScript easier and cleaner. Instead of writing common functions, again and again, the task can be accomplished with a single line of code.","url":"https://lodash.com/","status":"Adopt","category":"Languages and frameworks","isNew":false,"history":[],"comments":"only use treeshakable es6 version"},{"name":"Knockout","description":"Knockout is a JavaScript library that helps you to create rich, responsive display and editor user interfaces with a clean underlying data model. Any time you have sections of UI that update dynamically (e.g., changing depending on the user’s actions or when an external data source changes), KO can help you implement it more simply and maintainably.","url":"https://knockoutjs.com/","status":"On hold","category":"Languages and frameworks","isNew":false,"history":[],"comments":""},{"name":"Jest","description":"Jest is a JavaScript test runner, that is, a JavaScript library for creating, running, and structuring tests. Jest ships as an NPM package, you can install it in any JavaScript project. Jest is one of the most popular test runner these days, and the default choice for React projects.","url":"https://jestjs.io/","status":"Adopt","category":"Languages and frameworks","isNew":false,"history":[],"comments":""},{"name":"Handlebars","description":"Handlebars is a simple templating language. It uses a template and an input object to generate HTML or other text formats. Handlebars templates look like regular text with embedded Handlebars expressions.","url":"https://handlebarsjs.com/","status":"On hold","category":"Languages and frameworks","isNew":false,"history":[],"comments":"unless use case"},{"name":"Greensock (GSAP)","description":"The GreenSock Animation Platform (GSAP) is a popular set of JavaScript tools for building animations on the web. Anything you see in your web browser can be animated with GSAP. Whether you want to build elegant UI animations or dynamic effects in web apps, games, and interactive stories; GSAP is up to the task.\n\nHow does it work? You simply write short snippets of JavaScript code that define how elements should animate and what the timing should be. The benefit of animating with code is that one line of code can animate one thing just as easily as it can animate 1,000 things. With code-driven animation it’s surprisingly easy to randomize your animations and have them respond to user interaction.","url":"https://greensock.com/","status":"Trial","category":"Languages and frameworks","isNew":false,"history":[],"comments":"dependant on use case (anime/lottie/GSPA)"},{"name":"ExpressJS","description":"ExpressJS is considered as minimal as well as flexible web application framework of Node.js which gives robust features for use of the web as well as mobile applications. ExpressJS is also considered as an open source framework and it was developed and maintained by the foundation of NodeJS.\n\nIt also gives minimal interface in order to make our applications. ExpressJS, in addition, gives us tools which are needed in order to build the app. ExpressJS is also flexible since there exist various modules that are made available on npm and that can be directly plugged into it, i.e, Express.","url":"https://expressjs.com/","status":"Trial","category":"Languages and frameworks","isNew":false,"history":[],"comments":""},{"name":"Date-fns","description":"date-fns provides the most comprehensive, yet simple and consistent toolset for manipulating JavaScript dates in a browser & Node.js.","url":"https://date-fns.org/","status":"Adopt","category":"Languages and frameworks","isNew":false,"history":[],"comments":""},{"name":"Bulma","description":"Bulma is a free, open source framework that provides ready-to-use frontend components that you can easily combine to build responsive web interfaces.","url":"https://bulma.io/","status":"On hold","category":"Languages and frameworks","isNew":false,"history":[],"comments":""},{"name":"Babel","description":"Babel is a JavaScript compiler. Babel is a toolchain that is mainly used to convert ECMAScript 2015+ code into a backwards compatible version of JavaScript in current and older browsers or environments. Here are the main things Babel can do for you:\n\nTransform syntax\nPolyfill features that are missing in your target environment (through a third-party polyfill such as core-js)\nSource code transformations (codemods)","url":"https://babeljs.io/","status":"Adopt","category":"Tools","isNew":false,"history":[],"comments":"consider other types of polyfilling (core-js, polyfill.io)"},{"name":"Anime.js","description":"Anime.js is a lightweight JavaScript animation library with a simple, yet powerful API.\nIt works with CSS properties, SVG, DOM attributes and JavaScript Objects.","url":"https://animejs.com/","status":"Trial","category":"Languages and frameworks","isNew":false,"history":[],"comments":""},{"name":"Yarn","description":"Yarn is a package manager for your code. It allows you to use and share (e.g. JavaScript) code with other developers from around the world. Yarn does this quickly, securely, and reliably so you don’t ever have to worry.\n\nYarn allows you to use other developers’ solutions to different problems, making it easier for you to develop your software. If you have problems, you can report issues or contribute back, and when the problem is fixed, you can use Yarn to keep it all up to date.\n\nCode is shared through something called a package (sometimes referred to as a module). A package contains all the code being shared as well as a package.json file which describes the package.","url":"https://yarnpkg.com/","status":"Assess","category":"Unsorted","isNew":false,"history":[],"comments":""},{"name":"Nuxt","description":"Nuxt.js is a higher-level framework that builds on top of Vue. It simplifies the development of universal or single page Vue apps.\nNuxt.js abstracts away the details of server and client code distribution so you can focus on application development. The goal with Nuxt is for it to be flexible enough for you to use as a main project base. Because most of what Nuxt does happens during the development phase, you get a lot of features with only a few extra kilobytes added to your JavaScript files.","url":"https://nuxtjs.org/","status":"Adopt","category":"Unsorted","isNew":false,"history":[],"comments":""},{"name":"Angular","description":"Angular is a development platform, built on TypeScript. As a platform, Angular includes:\n\nA component-based framework for building scalable web applications\nA collection of well-integrated libraries that cover a wide variety of features, including routing, forms management, client-server communication, and more\nA suite of developer tools to help you develop, build, test, and update your code\n\nWith Angular, you're taking advantage of a platform that can scale from single-developer projects to enterprise-level applications. Angular is designed to make updating as straightforward as possible, so take advantage of the latest developments with a minimum of effort. Best of all, the Angular ecosystem consists of a diverse group of over 1.7 million developers, library authors, and content creators.","url":"https://angular.io/","status":"Trial","category":"Languages and frameworks","isNew":false,"history":[],"comments":""},{"name":"Modernizr","description":"It’s a collection of superfast tests – or “detects” as we like to call them – which run as your web page loads, then you can use the results to tailor the experience to the user.","url":"https://modernizr.com/","status":"On hold","category":"Tools","isNew":false,"history":[],"comments":""},{"name":"Grunt","description":"Grunt is a JavaScript task runner, a tool used to automatically perform frequent tasks such as minification, compilation, unit testing, and linting. It uses a command-line interface to run custom tasks defined in a file (known as a Gruntfile).","url":"https://gruntjs.com/","status":"On hold","category":"Tools","isNew":false,"history":[],"comments":""},{"name":"Webpack","description":"At its core, webpack is a static module bundler for modern JavaScript applications. When webpack processes your application, it internally builds a dependency graph from one or more entry points and then combines every module your project needs into one or more bundles, which are static assets to serve your content from.","url":"https://webpack.js.org/","status":"Adopt","category":"Tools","isNew":false,"history":[],"comments":""},{"name":"Stylelint","description":"A mighty, modern linter that helps you avoid errors and enforce conventions in your styles. It can be extended to parse CSS-like syntaxes like SCSS, Sass and Less.","url":"https://stylelint.io/","status":"Adopt","category":"Tools","isNew":false,"history":[],"comments":""},{"name":"PostCSS","description":"PostCSS is a JavaScript tool that transforms your CSS code into an abstract syntax tree (AST) and then provides an API (application programming interface) for analyzing and modifying it using JavaScript plugins.\n\nPostCSS provides a large ecosystem of plugins to perform different functionalities like linting, minifying, inserting vendor prefixes, and many other things.\n\nDespite its name, it is neither a post-processor nor a pre-processor, it is just a transpiler that turns a special PostCSS plugin syntax into a Vanilla CSS. You can think of it as the Babel tool for CSS.\n\nYou can use PostCSS in conjunction with existing preprocessors like Sass, Less, and Stylus. Or you can use it as an alternative to all of them since it has all the required functionalities to be used alone.\n\nYou may have already been using PostCSS without knowing it. It's used in the popular Autoprefixer plugin which is used to automatically prepend vendor prefixes to CSS properties that require them.","url":"https://postcss.org/","status":"Adopt","category":"Tools","isNew":false,"history":[],"comments":""},{"name":"Storybook","description":"Storybook is a JavaScript tool that allows developers to create organized UI systems making both the building process and documentation more efficient and easier to use. Once you build out a component, Storybook lets you create a \"story\" file where you can then import your component and create various use case examples in an iFramed sandbox using that component. This provides an organized and focused environment to build new components and work on existing ones.","url":"https://storybook.js.org/","status":"Adopt","category":"Tools","isNew":false,"history":[],"comments":""},{"name":"NativeScript","description":"Popular for building truly native apps with JavaScript, NativeScript is one of the widely-used and well-known frameworks for front-end, cross-platform development. It allows direct access to all native platform APIs using JavaScript, TypeScript, or Angular, offering superior native-like experiences on web, iOS, and Android.\n\nAdvantages:\nEasy learning curve\nBacked by a strong community\nFully native performance\nOne code, multiple platforms\nDirect 100% access to iOS and Android APIs\nRich support for JavaScript, TypeScript, Angular, Vue, and CSS\nA wide range of plugins and templates for faster development","url":"https://nativescript.org/","status":"Trial","category":"Tools","isNew":false,"history":[],"comments":""},{"name":"Gulp.js","description":"A toolkit to automate & enhance your workflow. Leverage gulp and the flexibility of JavaScript to automate slow, repetitive workflows and compose them into efficient build pipelines.","url":"https://gulpjs.com/","status":"On hold","category":"Tools","isNew":false,"history":[],"comments":""},{"name":"Icon font","description":"Icon fonts are typefaces that use tiny images rather than letterforms. Like type, each character is scalable and can be modified using CSS.\n\nThe main reasons for using an icon font are that you can change the size, color, shape, with ease. Icon fonts are transparent by nature so you can put them on any color or type of background and you can add strokes or change the opacity of icons.","url":"https://designshack.net/articles/typography/what-is-an-icon-font/","status":"On hold","category":"Techniques","isNew":false,"history":[],"comments":"Please use SVG icon sprites instead."},{"name":"Monorepo","description":"A monorepo (mono repository) is a single repository that stores all of your code and assets for every project. Using a monorepo is important for many reasons. It creates a single source of truth. It makes it easier to share code. It even makes it easier to refactor code.","url":"https://www.toptal.com/front-end/guide-to-monorepos","status":"Adopt","category":"Techniques","isNew":false,"history":[],"comments":""},{"name":"SVG sprite icon","description":"","url":"https://medium.com/the-crazy-coder/an-optimized-icon-system-svg-sprites-5067e006a770","status":"Adopt","category":"Techniques","isNew":false,"history":[],"comments":""},{"name":"Progressive Web App","description":"Progressive Web Apps (PWAs) are web apps that use service workers, manifests, and other web-platform features in combination with progressive enhancement to give users an experience on par with native apps.\n\nPWAs provide a number of advantages to users — including being installable, progressively enhanced, responsively designed, re-engageable, linkable, discoverable, network independent, and secure.","url":"https://web.dev/progressive-web-apps/","status":"Adopt","category":"Techniques","isNew":false,"history":[],"comments":""},{"name":"HTTP/2","description":"HTTP/2 is the first upgrade to the Hypertext Transfer Protocol since 1999. It’s goal is to improve website performance by optimizing how HTTP is expressed “on-the-wire.” It doesn’t change the semantics of HTTP, which means header fields, status codes, and cookies work exactly the same way as in HTTP/1.1.","url":"https://developers.google.com/web/fundamentals/performance/http2","status":"Adopt","category":"Techniques","isNew":false,"history":[],"comments":""},{"name":"Prettier","description":"Prettier is an opinionated code formatter. It enforces a consistent style by parsing your code and re-printing it with its own rules that take the maximum line length into account, wrapping code when necessary.\n\nIt support formatting for: JavaScript, TypeScript, Flow, JSX, JSON, CSS, SCSS, Less, HTML, Vue, Angular, HANDLEBARS, Ember, Glimmer, GraphQL, Markdown, YAML","url":"https://prettier.io/","status":"Adopt","category":"Tools","isNew":false,"history":[],"comments":""},{"name":"ESLint","description":"ESLint is a static code analysis tool for identifying problematic patterns found in JavaScript code. Rules in ESLint are configurable, and customized rules can be defined and loaded. ESLint covers both code quality and coding style issues. ESLint supports current standards of ECMAScript, and experimental syntax from drafts for future standards. Code using JSX or TypeScript can also be processed when a plugin or transpiler is used.","url":"https://eslint.org/","status":"Adopt","category":"Tools","isNew":false,"history":[],"comments":""},{"name":"jQuery","description":"jQuery is a fast, small, and feature-rich JavaScript library. It makes things like HTML document traversal and manipulation, event handling, animation, and Ajax much simpler with an easy-to-use API that works across a multitude of browsers. With a combination of versatility and extensibility, jQuery has changed the way that millions of people write JavaScript.","url":"https://jquery.com/","status":"On hold","category":"Languages and frameworks","isNew":false,"history":[],"comments":""},{"name":"Underscore","description":"Underscore is a JavaScript library that provides a whole mess of useful functional programming helpers without extending any built-in objects. It’s the answer to the question: “If I sit down in front of a blank HTML page, and want to start being productive immediately, what do I need?” … and the tie to go along with jQuery's tux and Backbone's suspenders.","url":"https://underscorejs.org/","status":"On hold","category":"Languages and frameworks","isNew":false,"history":[],"comments":""},{"name":"Cypress","description":"Cypress IO is a user-friendly test automation tool for end to end testing, UI testing, regression suites, and integration and unit testing. It’s simple to install and doesn’t require any changes to your code. Cypress prides itself on writing tests quickly and in real-time as you build your web application. Often compared to Selenium, it differs by running tests within the device or browser being tested making it much faster.","url":"https://www.cypress.io/","status":"Adopt","category":"Languages and frameworks","isNew":false,"history":[],"comments":""},{"name":"React Native","description":"React Native combines the best parts of native development with React, a best-in-class JavaScript library for building user interfaces.\n\nUse a little—or a lot. You can use React Native today in your existing Android and iOS projects or you can create a whole new app from scratch.\n\nWritten in JavaScript—rendered with native code\nReact primitives render to native platform UI, meaning your app uses the same native platform APIs other apps do.\n\nMany platforms, one React. Create platform-specific versions of components so a single codebase can share code across platforms. With React Native, one team can maintain two platforms and share a common technology—React.","url":"https://reactnative.dev/","status":"Adopt","category":"Languages and frameworks","isNew":false,"history":[],"comments":""},{"name":"Accessibility (a11y)","description":"Accessibility (often abbreviated to A11y — as in \"a\" then 11 characters then \"y\") in Web development means enabling as many people as possible to use Web sites, even when those people's abilities are limited in some way.\n\nFor many people, technology makes things easier. For people with disabilities, technology makes things possible. Accessibility means developing content to be as accessible as possible no matter an individual's physical and cognitive abilities and no matter how they access the web.\n\n\"The Web is fundamentally designed to work for all people, whatever their hardware, software, language, culture, location, or physical or mental ability. When the Web meets this goal, it is accessible to people with a diverse range of hearing, movement, sight, and cognitive ability.\"","url":"https://developer.mozilla.org/en-US/docs/Web/Accessibility","status":"Adopt","category":"Unsorted","isNew":false,"history":[],"comments":""},{"name":"npm","description":"npm is the world's largest software registry. Open source developers from every continent use npm to share and borrow packages, and many organizations use npm to manage private development as well.\n\nnpm consists of three distinct components:\n\nthe website\nthe Command Line Interface (CLI)\nthe registry\nUse the website to discover packages, set up profiles, and manage other aspects of your npm experience. For example, you can set up organizations to manage access to public or private packages.\n\nThe CLI runs from a terminal, and is how most developers interact with npm.\n\nThe registry is a large public database of JavaScript software and the meta-information surrounding it.","url":"https://www.npmjs.com/","status":"Adopt","category":"Unsorted","isNew":false,"history":[],"comments":""},{"name":"Mocha","description":"Mocha is a feature-rich JavaScript test framework running on Node.js and in the browser, making asynchronous testing simple and fun. Mocha tests run serially, allowing for flexible and accurate reporting, while mapping uncaught exceptions to the correct test cases.","url":"https://mochajs.org/","status":"On hold","category":"Unsorted","isNew":false,"history":[],"comments":""},{"name":"Zeplin","description":"Zeplin is a plugin and standalone desktop application for Mac and Windows specifically designed to bridge the gap between designers and engineers. It takes designs from Sketch, Adobe XD CC, Figma, or Adobe Photoshop CC and exports them into a format which generates code snippets, design specs, and assets.","url":"https://zeplin.io/","status":"On hold","category":"Unsorted","isNew":false,"history":[],"comments":""},{"name":"CoreJS","description":"Modular standard library for JavaScript. Includes polyfills for ECMAScript up to 2021: promises, symbols, collections, iterators, typed arrays, many other features, ECMAScript proposals, some cross-platform WHATWG / W3C features and proposals like URL. You can load only required features or use it without global namespace pollution.","url":"https://github.com/zloirock/core-js","status":"Adopt","category":"Unsorted","isNew":false,"history":[],"comments":""},{"name":"Sonarqube","description":"SonarQube® is an automatic code review tool to detect bugs, vulnerabilities, and code smells in your code. It can integrate with your existing workflow to enable continuous code inspection across your project branches and pull requests.","url":"https://docs.sonarqube.org/latest/","status":"Adopt","category":"Tools","isNew":false,"history":[],"comments":""},{"name":"Lighthouse CLI","description":"Lighthouse is an open-source, automated tool for improving the quality of web pages. You can run it against any web page, public or requiring authentication. It has audits for performance, accessibility, progressive web apps, SEO and more.\n\nYou can run Lighthouse in Chrome DevTools, from the command line, or as a Node module. You give Lighthouse a URL to audit, it runs a series of audits against the page, and then it generates a report on how well the page did. From there, use the failing audits as indicators on how to improve the page. Each audit has a reference doc explaining why the audit is important, as well as how to fix it.","url":"https://developers.google.com/web/tools/lighthouse#cli","status":"Adopt","category":"Tools","isNew":false,"history":[],"comments":""},{"name":"D3js","description":"D3.js is a JavaScript library for manipulating documents based on data. D3 helps you bring data to life using HTML, SVG, and CSS. D3’s emphasis on web standards gives you the full capabilities of modern browsers without tying yourself to a proprietary framework, combining powerful visualization components and a data-driven approach to DOM manipulation.","url":"https://d3js.org/","status":"Adopt","category":"Unsorted","isNew":false,"history":[],"comments":""},{"name":"gRPC","description":"gRPC is a modern open source high performance Remote Procedure Call (RPC) framework that can run in any environment. It can efficiently connect services in and across data centers with pluggable support for load balancing, tracing, health checking and authentication. It is also applicable in last mile of distributed computing to connect devices, mobile applications and browsers to backend services.","url":"https://grpc.io/","status":"Assess","category":"Languages and frameworks","isNew":false,"history":[],"comments":""},{"name":"CQRS","description":"CQRS stands for Command and Query Responsibility Segregation, a pattern that separates read and update operations for a data store. Implementing CQRS in your application can maximize its performance, scalability, and security. The flexibility created by migrating to CQRS allows a system to better evolve over time and prevents update commands from causing merge conflicts at the domain level.","url":"https://docs.microsoft.com/en-us/azure/architecture/patterns/cqrs","status":"Trial","category":"Unsorted","isNew":false,"history":[],"comments":""},{"name":"WebAssembly","description":"WebAssembly is a new type of code that can be run in modern web browsers — it is a low-level assembly-like language with a compact binary format that runs with near-native performance and provides languages such as C/C++, C# and Rust with a compilation target so that they can run on the web. It is also designed to run alongside JavaScript, allowing both to work together.\n\nWebAssembly has huge implications for the web platform — it provides a way to run code written in multiple languages on the web at near native speed, with client apps running on the web that previously couldn't have done so.\n\nWebAssembly is designed to complement and run alongside JavaScript — using the WebAssembly JavaScript APIs, you can load WebAssembly modules into a JavaScript app and share functionality between the two. This allows you to take advantage of WebAssembly's performance and power and JavaScript's expressiveness and flexibility in the same apps, even if you don't know how to write WebAssembly code.","url":"https://webassembly.org/","status":"Assess","category":"Unsorted","isNew":false,"history":[],"comments":""},{"name":"parcel","description":"Parcel is a web application bundler, differentiated by its developer experience. It offers blazing fast performance utilizing multicore processing, and requires zero configuration.","url":"https://parceljs.org/","status":"Assess","category":"Unsorted","isNew":false,"history":[],"comments":""},{"name":"Application Insights (Azure","description":"Application Insights is a feature of Azure Monitor that provides extensible application performance management (APM) and monitoring for live web apps. Developers and DevOps professionals can use Application Insights to:\n\nAutomatically detect performance anomalies.\nHelp diagnose issues by using powerful analytics tools.\nSee what users actually do with apps.\nHelp continuously improve app performance and usability.\nApplication Insights:\n\nSupports a wide variety of platforms, including .NET, Node.js, Java, and Python.\nWorks for apps hosted on-premises, hybrid, or on any public cloud.\nIntegrates with DevOps processes.\nHas connection points to many development tools.\nCan monitor and analyze telemetry from mobile apps by integrating with Visual Studio","url":"https://docs.microsoft.com/en-us/azure/azure-monitor/app/app-insights-overview","status":"Trial","category":"Unsorted","isNew":false,"history":[],"comments":""},{"name":"Micro Frontends","description":"Micro frontends are a pattern where web application UIs (front ends) are composed from semi-independent fragments that can be built by different teams using different technologies. Micro-frontend architectures resemble back-end architectures where back ends are composed from semi-independent microservices.","url":"https://micro-frontends.org/","status":"Adopt","category":"Unsorted","isNew":false,"history":[],"comments":""},{"name":"githooks","description":"What are Git hooks?\nGit hooks are scripts that Git executes before or after events such as: commit, push, and receive. Git hooks are a built-in feature - no need to download anything. Git hooks are run locally.\n\nThese hook scripts are only limited by a developer's imagination. Some example hook scripts include:\n\npre-commit: Check the commit message for spelling errors.\npre-receive: Enforce project coding standards.\npost-commit: Email/SMS team members of a new commit.\npost-receive: Push the code to production.","url":"https://githooks.com/","status":"Adopt","category":"Unsorted","isNew":false,"history":[],"comments":""},{"name":"dependency drift fitness function ","description":"Dependency drift fitness function is a technique to introduce a specific evolutionary architecture fitness function to track these dependencies over time, thus giving an indication of the possible work needed and whether a potential issue is getting better or worse.\n\nAn example is https://github.com/dependabot","url":"","status":"Adopt","category":"Unsorted","isNew":false,"history":[],"comments":""},{"name":"Polyfill.io","description":"It's a service which accepts a request for a set of browser features and returns only the polyfills that are needed by the requesting browser.\n\nWhy do I need it?\nThere are lots of differing browsers and browser versions in use throughout the world, each one has a slightly different set of features to the rest. This can make developing for browsers a difficult task. The latest versions of the popular browsers can do lots of things which older browsers can not – but you may still have to support the older browsers. Polyfill.io makes it simpler to support differing browsers by attempting to recreate the missing features with polyfills: You can make use of the latest and greatest features in browsers which support them, and in those that do not.","url":"https://polyfill.io/","status":"Adopt","category":"Unsorted","isNew":false,"history":[],"comments":""},{"name":"GraphQL","description":"GraphQL is a query language for APIs and a runtime for fulfilling those queries with your existing data. GraphQL provides a complete and understandable description of the data in your API, gives clients the power to ask for exactly what they need and nothing more, makes it easier to evolve APIs over time, and enables powerful developer tools.","url":"https://graphql.org/","status":"Adopt","category":"Tools","isNew":false,"history":[],"comments":""},{"name":"Apollo GraphQL","description":"The Apollo Graph Platform unifies GraphQL across your apps and services, unlocking faster delivery for your engineering teams.","url":"https://www.apollographql.com/","status":"Adopt","category":"Unsorted","isNew":false,"history":[],"comments":""},{"name":"NodeJS","description":"Node.js is an open-source, cross-platform, back-end JavaScript runtime environment that runs on the V8 engine and executes JavaScript code outside a web browser. Node.js lets developers use JavaScript to write command line tools and for server-side scripting—running scripts server-side to produce dynamic web page content before the page is sent to the user's web browser. Consequently, Node.js represents a \"JavaScript everywhere\" paradigm,[6] unifying web-application development around a single programming language, rather than different languages for server-side and client-side scripts.\n\nNode.js has an event-driven architecture capable of asynchronous I/O. These design choices aim to optimize throughput and scalability in web applications with many input/output operations, as well as for real-time Web applications (e.g., real-time communication programs and browser games).[7]","url":"https://nodejs.org/en/about/","status":"Adopt","category":"Unsorted","isNew":false,"history":[],"comments":""},{"name":"Next.js","description":"The React Framework for Production\nNext.js gives you the best developer experience with all the features you need for production: hybrid static & server rendering, TypeScript support, smart bundling, route pre-fetching, and more. No config needed.","url":"https://nextjs.org/","status":"Trial","category":"Unsorted","isNew":false,"history":[],"comments":""},{"name":"Fractal.build","description":"Fractal is a tool to help you build and document web component libraries, and then integrate them into your projects.\n\nComponent (or pattern) libraries are a way of designing and building websites in a modular fashion, breaking up the UI into small, reusable chunks that can then later be assembled in a variety of ways to build anything from larger components right up to whole pages.\n\nFractal helps you assemble, preview and document website component libraries, and then integrate them into your web sites, apps and build processes to create joined up, 'living' projects.\n\nFractal can be run from the command line or integrated into your project via its API.","url":"https://fractal.build/","status":"Trial","category":"Unsorted","isNew":false,"history":[],"comments":""},{"name":"Svelte","description":"Svelte is a radical new approach to building user interfaces. Whereas traditional frameworks like React and Vue do the bulk of their work in the browser, Svelte shifts that work into a compile step that happens when you build your app. Instead of using techniques like virtual DOM diffing, Svelte writes code that surgically updates the DOM when the state of your app changes.","url":"https://svelte.dev/","status":"Trial","category":"Unsorted","isNew":false,"history":[],"comments":""},{"name":"Gatsby","description":"Gatsby enables developers to build fast, secure, and powerful websites using a React-based framework and innovative data layer that makes integrating different content, APIs, and services into one web experience incredibly simple.","url":"https://www.gatsbyjs.com/","status":"Assess","category":"Unsorted","isNew":false,"history":[],"comments":""},{"name":"Netlify / Vercel / Heroku","description":"Cloud hosting platforms","url":"https://medium.com/beyondx/top-4-free-cloud-hosting-platforms-ea7715e9823f","status":"Assess","category":"Unsorted","isNew":false,"history":[],"comments":""},{"name":"Lottie","description":"Lottie is a library for Android, iOS, Web, and Windows that parses Adobe After Effects animations exported as json with Bodymovin and renders them natively on mobile and on the web!","url":"https://airbnb.io/lottie/#/","status":"Adopt","category":"Unsorted","isNew":false,"history":[],"comments":""},{"name":"component libraries & styleguides","description":"What Is a Style Guide?\nA style guide is a set of rules for how your brand should be displayed. This is both visual (design & imagery) as well as written content (voice & tone). The purpose of a style guide is to allow multiple contributors to create content clearly that cohesively represents the brand. Almost every major brand has a style guide, though not all are public.\n\nWhat is a Component Library?\n\nComponent Library\nA component library is living, breathing implementation of your style guide. It's a shared set of UI components that developers can consume to build applications reflecting your brand. Some notable benefits:\n\nHaving a component library means less custom code for consumers.\nSince there's a central location, you can ensure all components meet accessibility requirements.\nComponents become more robust with multiple contributors submitting bug fixes and improvements in a single place.\nLess duplication of code allows you to ship new products and rewrite legacy code faster.","url":"https://medium.com/next-generation-web/style-guides-design-systems-component-libraries-explained-118e79476305","status":"Adopt","category":"Unsorted","isNew":false,"history":[],"comments":""},{"name":"Semantic Releases","description":"Fully automated version management and package publishing. Semantic release automates the whole package release workflow including: determining the next version number, generating the release notes, and publishing the package.\n\nThis removes the immediate connection between human emotions and version numbers, strictly following the Semantic Versioning specification and communicating the impact of changes to consumers.","url":"https://github.com/semantic-release/semantic-release","status":"Trial","category":"Unsorted","isNew":false,"history":[],"comments":""},{"name":"webRTC","description":"With WebRTC, you can add real-time communication capabilities to your application that works on top of an open standard. It supports video, voice, and generic data to be sent between peers, allowing developers to build powerful voice- and video-communication solutions. The technology is available on all modern browsers as well as on native clients for all major platforms. The technologies behind WebRTC are implemented as an open web standard and available as regular JavaScript APIs in all major browsers. For native clients, like Android and iOS applications, a library is available that provides the same functionality. The WebRTC project is open-source and supported by Apple, Google, Microsoft and Mozilla, amongst others. This page is maintained by the Google WebRTC team.","url":"https://webrtc.org/","status":"Trial","category":"Unsorted","isNew":false,"history":[],"comments":""},{"name":"styleguidist","description":"React Styleguidist is a component development environment with hot reloaded dev server and a living style guide that you can share with your team. It lists component propTypes and shows live, editable usage examples based on Markdown files.\n\nAlso comes in a Vue.js variant: https://vue-styleguidist.github.io/","url":"https://react-styleguidist.js.org/","status":"Assess","category":"Unsorted","isNew":false,"history":[],"comments":""},{"name":"Serverless","description":"Serverless computing is an architecture where code execution is fully managed by a cloud provider, instead of the traditional method of developing applications and deploying them on servers.\n\nIt means developers don't have to worry about managing, provisioning and maintaining servers when deploying code. Previously a developer would have to define how much storage and database capacity would be needed pre-deployment, slowing the whole process down.","url":"https://www.computerworld.com/article/3427298/what-is-serverless-computing-and-which-enterprises-are-adopting-it.html","status":"Assess","category":"Unsorted","isNew":false,"history":[],"comments":""},{"name":"Cloud functions","description":"Cloud Functions is a serverless execution environment for building and connecting cloud services. With Cloud Functions you write simple, single-purpose functions that are attached to events emitted from your cloud infrastructure and services. Your function is triggered when an event being watched is fired. Your code executes in a fully managed environment. There is no need to provision any infrastructure or worry about managing any servers.","url":"https://cloud.google.com/functions/docs/concepts/overview","status":"Assess","category":"Unsorted","isNew":false,"history":[],"comments":""},{"name":"Vite","description":"Vite (French word for \"quick\", pronounced /vit/, like \"veet\") is a build tool that aims to provide a faster and leaner development experience for modern web projects. It consists of two major parts:\n\nA dev server that provides rich feature enhancements over native ES modules, for example extremely fast Hot Module Replacement (HMR).\n\nA build command that bundles your code with Rollup, pre-configured to output highly optimized static assets for production.\n\nVite is opinionated and comes with sensible defaults out of the box, but is also highly extensible via its Plugin API and JavaScript API with full typing support.","url":"https://vitejs.dev/","status":"Assess","category":"Unsorted","isNew":false,"history":[],"comments":""},{"name":"css in js","description":"CSS-in-JS is a styling technique where JavaScript is used to style components. When this JavaScript is parsed, CSS is generated (usually as a <style> element) and attached into the DOM. It allows to abstract CSS to the component level itself, using JavaScript to describe styles in a declarative and maintainable way. \nCSS-in-JS is capable of other things which were not possible using traditional CSS techniques. It is possible to make the styles dynamic in line with just a few conditional statements. It also allows users to write more modular code with your CSS being encapsulated in the same block as user's javascript, scoping it to that module only.","url":"https://css-tricks.com/a-thorough-analysis-of-css-in-js/","status":"Adopt","category":"Unsorted","isNew":false,"history":[],"comments":""},{"name":"Design systems","description":"A design system is a collection of reusable graphical components, design standards, style guides, which define a common visual language for product teams. It accelerates the design process and bridges the gap between teams involved in building a final product by having clear graphics standards, that makes assembling websites from components super easy. So basically the design system is a rulebook for graphical and development teams which we can breakdown like that:\n\nDesign System – the complete set of design standards along with principles, patterns & code components to achieve them,\nPattern Library – a subclass of a design system which defines allowed design patterns,\nStyle guide – a subclass showing how products should look, containing use cases for UI patterns, typography etc.","url":"https://dev.to/graphqleditor/what-s-design-system-and-why-you-need-one-31fh","status":"Adopt","category":"Techniques","isNew":false,"history":[],"comments":""},{"name":"Critical Path CSS","description":"Critical CSS is a technique that extracts the CSS for above-the-fold content in order to render content to the user as fast as possible.\nAbove-the-fold is all the content a viewer sees on page load, before scrolling. There is no universally defined pixel height of what is considered above the fold content since there is a myriad of devices and screen sizes.\nInlining extracted styles in the <head> of the HTML document eliminates the need to make an additional request to fetch these styles. The remainder of the CSS can be loaded asynchronously.","url":"https://web.dev/extract-critical-css/","status":"Adopt","category":"Techniques","isNew":false,"history":[],"comments":""},{"name":"Debugbear","description":"DebugBear keeps track of your site speed and Core Web Vitals. Monitor the performance of your website and benchmark against the competition. Get alerted in Slack or by email when there's a problem. DebugBear is built on top of Google's Lighthouse tool, but provides additional in-depth debug data for developers. It also keeps track of the real-user Core Web Vitals metrics that Google uses for their search rankings.","url":"https://www.debugbear.com/","status":"Adopt","category":"Unsorted","isNew":false,"history":[],"comments":""},{"name":"Jamstack / Mach","description":"JAMstack is a term that describes a modern web development architecture based on JavaScript, APIs, and Markup (JAM). JAMstack isn’t a specific technology, but rather a different way of building apps and websites.\n\nInstead of using a traditional CMS or site builder, a JAMstack site splits up the code (JavaScript), the site infrastructure (APIs), and the content (Markup). These will all be handled in a decoupled architecture and with a clear split between server-side and client-side. In fact, the main idea behind building JAMstack websites and applications is to push as much of the load as possible away from the server and onto the client. By doing so, it dramatically reduces the number of requests sent to a server and thus eliminates a lot of the waiting time that comes with a server handling a request and sending it back to the client.","url":"https://jamstack.org/what-is-jamstack/","status":"Adopt","category":"Unsorted","isNew":false,"history":[],"comments":""},{"name":"SXA","description":"Sitecore Experience Accelerator\nSXA separates structure from design, so front-end designers, creative designers, content authors, and developers can work in parallel and you can deploy and maintain multiple sites quickly and cost effectively. Once a basic user experience plan is in place, everyone can get started on the platform. For example: the content author can start entering the content in the wireframe environment, while the front-end developer works on the theme, and the developer sets up the data templates.","url":"https://doc.sitecore.com/xp/en/users/sxa/17/sitecore-experience-accelerator/introducing-sitecore-experience-accelerator.html","status":"On hold","category":"Unsorted","isNew":false,"history":[{"ring":"On hold","description":"Test","_metadata":{"uid":"cs61d1ee090f3c474a"}}],"comments":""},{"name":"DayJS","description":"Fast 2kB alternative to Moment.js with the same modern API","url":"https://day.js.org/","status":"Assess","category":"Unsorted","isNew":false,"history":[],"comments":""}],"categories":["Languages and frameworks","Techniques","Tools","Unsorted"],"statuses":["Adopt","Assess","On hold","Trial"]}